Задача 19

Вы продолжаете разработку интернет-магазина.

Теперь в магазине доступна курьерская доставка. Соответственно, у заказа есть время доставки.

У курьера есть фамилия, имя, номер сотрудника.




Разработайте следующую функциональность:

1. Получение по id пользователя времени доставки всех его заказов вместе с именами курьеров, которые эти заказы выполняют.

2. Получение по id курьера всех заказов, которые ему нужно доставить (вместе с именами получателей).


В main продемонстрируйте работу программы

