Задача 3
Реализовать функцию, вычисляющую площадь треугольника по координатам его вершин в декартовой системе координат. Результат вывести на экран.
 
Для задания координат можно определить вспомогательный класс Point (ниже пример того, как можно его реализовать):
 
public class Main {
 
  static class Point {
    double x;
    double y;
  }
 
  public static void main(String[] args) {
 
    Point a = new Point();
    a.x = 0.0;
    a.y = 0.0;
 
    Point b = new Point();
    b.x = 2.0;
    b.y = 0.0;
 
    Point c = new Point();
    c.x = 0.0;
    c.y = 2.0;
 
    // ...
  }
}
 
Для вычисления площади можно использовать формулу Герона или применить геометрические свойства векторного произведения. Функция извлечения квадратного корня в Java: Math.sqrt(x).
Входные данные
Программа получает входные параметры с консоли, каждую координату отдельно для каждой вершины.
Тестовые примеры
Вершина1
Вершина2
Вершина3
Результат
(0,0)
(2,0)
(0,2)
2
(0,0)
(1,0)
(0,1)
0.5
(-5,3)
(4,-7)
(3,14)
89.5
(-5,-15)
(-20,-8)
(-110,-213)
1852.5

Пример вызова программы
% java ru/croc/task1/Main 0 0 0 2 2 0
% Площадь треугольника: 2
 
Если командная строка не видит JAVA - скорее всего необходимо корректно установить переменные окружения (environment variables). См. (пример для java 10, но аналогично для любой другой версии): https://docs.oracle.com/javase/10/install/installation-jdk-and-jre-microsoft-windows-platforms.htm#JSJIG-GUID-96EB3876-8C7A-4A25-9F3A-A2983FEC016A
 


