Задача 15
Ваша команда разрабатывает приложение для проведения социологических опросов. Вы работаете над модулем разбивки респондентов по возрастным группам. При этом модуль вы реализуете в виде отдельного Java-приложения, работающего со стандартными потоками ввода-вывода. На вход (System.in) оно принимает список участников опроса в текстовом виде, на выходе (System.out) выдает их разбивку по группам возрастов.

В качестве аргументов командной строки приложению указывается последовательность чисел, задающих границы возрастных групп.
Пример
18 25 35 45 60 80 100

Эта последовательность определяет возрастные группы: от 0 до 18 лет, от 19 до 25 лет, от 26 до 35 лет и так далее. Последняя группа: от 101 года и старше.

Входные данные (список респондентов) задаются в виде строк:

<ФИО>,<возраст>

Строка END сигнализирует об окончании списка.

Выходные данные (разбивка по возрастным группам) представлены как последовательность строк следующего формата:

<Группа>: <ФИО_1> (возраст_1), <ФИО_2> (возраст_2), …, <ФИО_N> (возраст_N)

При этом:

группы строк перечисляются в порядке от старшей к младшей
в каждой группе перечисляются только респонденты, попадающие в нее по возрасту
список респондентов в каждой группе отсортирован по возрасту в порядке убывания, если возраст совпадает - по ФИО в порядке возрастания
если в возрастную группу не попадает ни один из респондентов, строка с этой группой не выводится
Пример
101+: Кошельков Захар Брониславович (105)
81-100: Дьячков Нисон Иринеевич (88), Иванов Варлам Якунович (88)
46-60: Старостин Ростислав Ермолаевич (50)
26-35: Ярилова Розалия Трофимовна (29)
0-18: Соколов Андрей Сергеевич (15), Егоров Алан Петрович (7)

При реализации можно учитывать, что:

нет людей старше 123 лет
в рамках одного опроса не может встретиться полных однофамильцев с одинаковыми возрастами

Реализуйте приложение. При этом постарайтесь продумать структуру данных и использовать коллекции, максимально подходящие для поставленных целей.
