Задача 5
От пользователей приложения (см. задачу 4) пришел запрос на возможность перемещать уже размеченные области. Для поддержки новой функциональности вам требуется внести несколько изменений: 

1) выбор аннотации по координатам точки (x, y);

В массиве аннотаций требуется найти первую, фигура которой содержит точку с заданными координатами.

Annotation findByPoint(int x, int y) {
  // ...
}

2) выбор аннотации по шаблону подписи;

В массиве аннотаций требуется найти первую, подпись которой содержит заданную подстроку.

Annotation findByLabel(String label) {
  // ...
}

Определить, содержит ли строка заданную подстроку, можно с помощью метода contains(CharSequence s) класса String.

3) перемещение фигуры выбранной аннотации на смещение (dx, dy);

В рамках этого изменения вы решили доработать классы фигур таким образом, чтобы они реализовывали интерфейс

public interface Movable {
  
  void move(int dx, int dy);
}

Доработайте классы и реализуйте соответствующие методы.
